[Killed] ConditionalExpression
TestUnitaire/tp-jest/src/interval.js:26:16
      * @returns {boolean}
      */
     overlaps(interval) {
-        return this.end > interval.start && this.start < interval.end;
+        return false;
     }
 

[Killed] ConditionalExpression
TestUnitaire/tp-jest/src/interval.js:26:16
      * @returns {boolean}
      */
     overlaps(interval) {
-        return this.end > interval.start && this.start < interval.end;
+        return false && this.start < interval.end;
     }
 

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/interval.js:46:41
      * @returns {boolean}
      */
     includes(interval) {
-	return (interval.start>= this.start && interval.end<= this.end);
+	return (interval.start>= this.start && interval.end > this.end);
     };
 

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/interval.js:46:10
      * @returns {boolean}
      */
     includes(interval) {
-	return (interval.start>= this.start && interval.end<= this.end);
+	return (interval.start < this.start && interval.end<= this.end);
     };
 

[Killed] Block
TestUnitaire/tp-jest/src/interval.js:65:21
      * @param {Interval} interval
      * @returns {Interval[]}
      */
-    union(interval) {
-	let newStart = this.start;
-	let newEnd = this.end;
-	if(this.end < interval.start ){
-		return [this, interval];
-	}else if( interval.end < this.start){
-		return[interval,this];
-	} 	
-			
-	if(interval.start> this.start) newStart= this.start;
-	else newStart= interval.start;
-	
-	if(interval.end< this.end) newEnd= this.end;
-	else newEnd= interval.end;
-	
-	return new Interval(newStart,newEnd);
-    };
+    union(interval) {};
 
     /**

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/interval.js:68:5
     union(interval) {
 	let newStart = this.start;
 	let newEnd = this.end;
-	if(this.end < interval.start ){
+	if(this.end >= interval.start ){
 		return [this, interval];
 	}else if( interval.end < this.start){

[Killed] IfStatement
TestUnitaire/tp-jest/src/interval.js:68:5
     union(interval) {
 	let newStart = this.start;
 	let newEnd = this.end;
-	if(this.end < interval.start ){
+	if(true ){
 		return [this, interval];
 	}else if( interval.end < this.start){

[Killed] IfStatement
TestUnitaire/tp-jest/src/interval.js:70:12
 	let newEnd = this.end;
 	if(this.end < interval.start ){
 		return [this, interval];
-	}else if( interval.end < this.start){
+	}else if( true){
 		return[interval,this];
 	} 	

[Killed] Block
TestUnitaire/tp-jest/src/interval.js:70:38
 	let newEnd = this.end;
 	if(this.end < interval.start ){
 		return [this, interval];
-	}else if( interval.end < this.start){
-		return[interval,this];
-	} 	
+	}else if( interval.end < this.start){} 	
 			
 	if(interval.start> this.start) newStart= this.start;

[Killed] IfStatement
TestUnitaire/tp-jest/src/interval.js:74:5
 		return[interval,this];
 	} 	
 			
-	if(interval.start> this.start) newStart= this.start;
+	if(false) newStart= this.start;
 	else newStart= interval.start;
 	

[Killed] IfStatement
TestUnitaire/tp-jest/src/interval.js:74:5
 		return[interval,this];
 	} 	
 			
-	if(interval.start> this.start) newStart= this.start;
+	if(true) newStart= this.start;
 	else newStart= interval.start;
 	

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/interval.js:77:5
 	if(interval.start> this.start) newStart= this.start;
 	else newStart= interval.start;
 	
-	if(interval.end< this.end) newEnd= this.end;
+	if(interval.end >= this.end) newEnd= this.end;
 	else newEnd= interval.end;
 	

[Killed] IfStatement
TestUnitaire/tp-jest/src/interval.js:77:5
 	if(interval.start> this.start) newStart= this.start;
 	else newStart= interval.start;
 	
-	if(interval.end< this.end) newEnd= this.end;
+	if(true) newEnd= this.end;
 	else newEnd= interval.end;
 	

[Killed] IfStatement
TestUnitaire/tp-jest/src/interval.js:102:5
     intersection(interval) {
 	let newStart = null;
 	let newEnd = null;	
-	if(this.end > interval.start && this.start < interval. start){
+	if(true){
 		newStart = interval.start;
 		for (let i= newStart; i<=this.end; i++){

[Killed] IfStatement
TestUnitaire/tp-jest/src/interval.js:102:5
     intersection(interval) {
 	let newStart = null;
 	let newEnd = null;	
-	if(this.end > interval.start && this.start < interval. start){
+	if(false){
 		newStart = interval.start;
 		for (let i= newStart; i<=this.end; i++){

[Killed] Block
TestUnitaire/tp-jest/src/interval.js:104:42
 	let newEnd = null;	
 	if(this.end > interval.start && this.start < interval. start){
 		newStart = interval.start;
-		for (let i= newStart; i<=this.end; i++){
-			if(i > interval.end){ break;}
-			newEnd = i;
-		}
+		for (let i= newStart; i<=this.end; i++){}
 	}else if (interval.end > this.start && interval.start < this.start){
 		newStart = this.start;

[Killed] IfStatement
TestUnitaire/tp-jest/src/interval.js:105:7
 	if(this.end > interval.start && this.start < interval. start){
 		newStart = interval.start;
 		for (let i= newStart; i<=this.end; i++){
-			if(i > interval.end){ break;}
+			if(true){ break;}
 			newEnd = i;
 		}

[Killed] Block
TestUnitaire/tp-jest/src/interval.js:105:24
 	if(this.end > interval.start && this.start < interval. start){
 		newStart = interval.start;
 		for (let i= newStart; i<=this.end; i++){
-			if(i > interval.end){ break;}
+			if(i > interval.end){}
 			newEnd = i;
 		}

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/interval.js:108:12
 			if(i > interval.end){ break;}
 			newEnd = i;
 		}
-	}else if (interval.end > this.start && interval.start < this.start){
+	}else if (interval.end >= this.start && interval.start < this.start){
 		newStart = this.start;
 		for(let j=0 ; j<= interval.end; j++){

[Killed] ForStatement
TestUnitaire/tp-jest/src/interval.js:110:17
 		}
 	}else if (interval.end > this.start && interval.start < this.start){
 		newStart = this.start;
-		for(let j=0 ; j<= interval.end; j++){
+		for(let j=0 ; false; j++){
 			if(j>this.end) break;
 			newEnd = j ;

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/interval.js:111:7
 	}else if (interval.end > this.start && interval.start < this.start){
 		newStart = this.start;
 		for(let j=0 ; j<= interval.end; j++){
-			if(j>this.end) break;
+			if(j >= this.end) break;
 			newEnd = j ;
 		}

[Killed] IfStatement
TestUnitaire/tp-jest/src/interval.js:115:5
 			newEnd = j ;
 		}
 	}
-	if(newStart == null) return null;
+	if(true) return null;
 	return new Interval(newStart,newEnd);
     };

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/interval.js:136:6
      * @returns {Interval[]}
      */
     exclusion(interval) {
-	if (this.start == interval.start && this.end == interval.end) return null;	
+	if (this.start != interval.start && this.end == interval.end) return null;	
 	if(this.end < interval.start ){
 		return [this, interval];

[Killed] IfStatement
TestUnitaire/tp-jest/src/interval.js:136:6
      * @returns {Interval[]}
      */
     exclusion(interval) {
-	if (this.start == interval.start && this.end == interval.end) return null;	
+	if (true) return null;	
 	if(this.end < interval.start ){
 		return [this, interval];

[Killed] IfStatement
TestUnitaire/tp-jest/src/interval.js:137:5
      */
     exclusion(interval) {
 	if (this.start == interval.start && this.end == interval.end) return null;	
-	if(this.end < interval.start ){
+	if(true ){
 		return [this, interval];
 	}else if( interval.end < this.start){

[Killed] IfStatement
TestUnitaire/tp-jest/src/interval.js:137:5
      */
     exclusion(interval) {
 	if (this.start == interval.start && this.end == interval.end) return null;	
-	if(this.end < interval.start ){
+	if(false ){
 		return [this, interval];
 	}else if( interval.end < this.start){

[Killed] ConditionalExpression
TestUnitaire/tp-jest/src/interval.js:147:63
 	let inter_end1=null;
 	let inter_end2=null;
 	let inter = this.intersection(interval);	
-	if((this.end>interval.start && interval.start>this.start) && interval.end> this.end){
+	if((this.end>interval.start && interval.start>this.start) && false){
 		inter_start1 = this.start;
 		inter_end1 = inter.start 

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/interval.js:147:6
 	let inter_end1=null;
 	let inter_end2=null;
 	let inter = this.intersection(interval);	
-	if((this.end>interval.start && interval.start>this.start) && interval.end> this.end){
+	if((this.end <= interval.start && interval.start>this.start) && interval.end> this.end){
 		inter_start1 = this.start;
 		inter_end1 = inter.start 

[Killed] ConditionalExpression
TestUnitaire/tp-jest/src/interval.js:153:12
 		
 		inter_start2 = inter.end;
 		inter_end2 = interval.end;
-	}else if((interval.end> this.start && this.start> interval.start) && this.end> interval.end){
+	}else if((true) && this.end> interval.end){
 		inter_start1 = interval.start;
 		inter_end1 = inter.start 

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/interval.js:153:71
 		
 		inter_start2 = inter.end;
 		inter_end2 = interval.end;
-	}else if((interval.end> this.start && this.start> interval.start) && this.end> interval.end){
+	}else if((interval.end> this.start && this.start> interval.start) && this.end <= interval.end){
 		inter_start1 = interval.start;
 		inter_end1 = inter.start 

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/interval.js:159:12
 		
 		inter_start2 = inter.end;
 		inter_end2 = this.end;
-	}else if((this.end>interval.start && interval.start>this.start) && interval.end< this.end){
+	}else if((this.end <= interval.start && interval.start>this.start) && interval.end< this.end){
 		inter_start1 = this.start;
 		inter_end1 = inter.start 

[Killed] Block
TestUnitaire/tp-jest/src/interval.js:159:92
 		
 		inter_start2 = inter.end;
 		inter_end2 = this.end;
-	}else if((this.end>interval.start && interval.start>this.start) && interval.end< this.end){
-		inter_start1 = this.start;
-		inter_end1 = inter.start 
-		
-		inter_start2 = inter.end;
-		inter_end2 = this.end;
-	}else if ((interval.end> this.start && this.start> interval.start) && this.end < interval.end){
+	}else if((this.end>interval.start && interval.start>this.start) && interval.end< this.end){}else if ((interval.end> this.start && this.start> interval.start) && this.end < interval.end){
 		inter_start1 = interval.start;
 		inter_end1 = inter.start 

[Killed] ConditionalExpression
TestUnitaire/tp-jest/src/interval.js:165:13
 		
 		inter_start2 = inter.end;
 		inter_end2 = this.end;
-	}else if ((interval.end> this.start && this.start> interval.start) && this.end < interval.end){
+	}else if ((false) && this.end < interval.end){
 		inter_start1 = interval.start;
 		inter_end1 = inter.start 

[Killed] ConditionalExpression
TestUnitaire/tp-jest/src/interval.js:165:13
 		
 		inter_start2 = inter.end;
 		inter_end2 = this.end;
-	}else if ((interval.end> this.start && this.start> interval.start) && this.end < interval.end){
+	}else if ((false && this.start> interval.start) && this.end < interval.end){
 		inter_start1 = interval.start;
 		inter_end1 = inter.start 
