[Killed] Block
TestUnitaire/tp-jest/src/math.js:3:18
 let Util = {};
 Util.factorial = (n) => {
-    if (n === 0) {
-        return 1;
-    }
+    if (n === 0) {}
 
     if (n >= 3000) {

[Killed] IfStatement
TestUnitaire/tp-jest/src/math.js:7:9
         return 1;
     }
 
-    if (n >= 3000) {
+    if (false) {
         throw 'n too large'
     }

[Killed] ForStatement
TestUnitaire/tp-jest/src/math.js:33:21
     if (n < 0) {
         throw 'Unable to compute prime for n < 0'
     }
-    for (var i = 2; i < n; i++)
+    for (var i = 2; false; i++)
         if (n % i === 0) return false;
     return true;

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/math.js:34:13
         throw 'Unable to compute prime for n < 0'
     }
     for (var i = 2; i < n; i++)
-        if (n % i === 0) return false;
+        if (n % i !== 0) return false;
     return true;
 

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/math.js:34:13
         throw 'Unable to compute prime for n < 0'
     }
     for (var i = 2; i < n; i++)
-        if (n % i === 0) return false;
+        if (n * i === 0) return false;
     return true;
 

[Killed] Block
TestUnitaire/tp-jest/src/math.js:49:29
  * @param {number} n
  * @returns {number}
  */
-Util.sumPrime = function(n) {
-	var res=0;	
-	if(typeof n !=typeof 1) throw 'Unable to compute sumPrime for n not number (int)';
-	if(n>=2){
-		for(var i=2; i<=n;i++){
-			if(Util.isPrime(i)){
-				res+=i;			
-			}
-		}
-	}
-	if(n<0){
-		throw 'Unable to compute sumPrime for n < 0'	
-	}
-	return res;
-};
+Util.sumPrime = function(n) {};
 
 /**

[Killed] IfStatement
TestUnitaire/tp-jest/src/math.js:51:5
  */
 Util.sumPrime = function(n) {
 	var res=0;	
-	if(typeof n !=typeof 1) throw 'Unable to compute sumPrime for n not number (int)';
+	if(true) throw 'Unable to compute sumPrime for n not number (int)';
 	if(n>=2){
 		for(var i=2; i<=n;i++){

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/math.js:51:5
  */
 Util.sumPrime = function(n) {
 	var res=0;	
-	if(typeof n !=typeof 1) throw 'Unable to compute sumPrime for n not number (int)';
+	if(typeof n == typeof 1) throw 'Unable to compute sumPrime for n not number (int)';
 	if(n>=2){
 		for(var i=2; i<=n;i++){

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/math.js:52:5
 Util.sumPrime = function(n) {
 	var res=0;	
 	if(typeof n !=typeof 1) throw 'Unable to compute sumPrime for n not number (int)';
-	if(n>=2){
+	if(n > 2){
 		for(var i=2; i<=n;i++){
 			if(Util.isPrime(i)){

[Killed] Block
TestUnitaire/tp-jest/src/math.js:52:10
 Util.sumPrime = function(n) {
 	var res=0;	
 	if(typeof n !=typeof 1) throw 'Unable to compute sumPrime for n not number (int)';
-	if(n>=2){
-		for(var i=2; i<=n;i++){
-			if(Util.isPrime(i)){
-				res+=i;			
-			}
-		}
-	}
+	if(n>=2){}
 	if(n<0){
 		throw 'Unable to compute sumPrime for n < 0'	

[Killed] ForStatement
TestUnitaire/tp-jest/src/math.js:53:16
 	var res=0;	
 	if(typeof n !=typeof 1) throw 'Unable to compute sumPrime for n not number (int)';
 	if(n>=2){
-		for(var i=2; i<=n;i++){
+		for(var i=2; false;i++){
 			if(Util.isPrime(i)){
 				res+=i;			

[Killed] Block
TestUnitaire/tp-jest/src/math.js:53:25
 	var res=0;	
 	if(typeof n !=typeof 1) throw 'Unable to compute sumPrime for n not number (int)';
 	if(n>=2){
-		for(var i=2; i<=n;i++){
-			if(Util.isPrime(i)){
-				res+=i;			
-			}
-		}
+		for(var i=2; i<=n;i++){}
 	}
 	if(n<0){

[Killed] IfStatement
TestUnitaire/tp-jest/src/math.js:54:7
 	if(typeof n !=typeof 1) throw 'Unable to compute sumPrime for n not number (int)';
 	if(n>=2){
 		for(var i=2; i<=n;i++){
-			if(Util.isPrime(i)){
+			if(false){
 				res+=i;			
 			}

[Killed] IfStatement
TestUnitaire/tp-jest/src/math.js:54:7
 	if(typeof n !=typeof 1) throw 'Unable to compute sumPrime for n not number (int)';
 	if(n>=2){
 		for(var i=2; i<=n;i++){
-			if(Util.isPrime(i)){
+			if(true){
 				res+=i;			
 			}

[Killed] Block
TestUnitaire/tp-jest/src/math.js:59:9
 			}
 		}
 	}
-	if(n<0){
-		throw 'Unable to compute sumPrime for n < 0'	
-	}
+	if(n<0){}
 	return res;
 };

[Killed] Block
TestUnitaire/tp-jest/src/math.js:77:29
  * @param {number} n
  * @returns {array}
  */
-Util.fizzBuzz = function(n) {
-	var tabRes=[];
-	if(typeof n !=typeof 1) throw 'Unable to compute fizzBuzz for n not number (int)';
-	if(n<1){
-		throw 'Unable to compute fizzBuzz for n < 1';	
-	}
-	for (var i=1; i <= n; i++){
-    		if (i % 15 == 0) tabRes.push('FizzBuzz');
-    		else if (i % 3 == 0) tabRes.push("Fizz");
-    		else if (i % 5 == 0) tabRes.push("Buzz");
-    		else tabRes.push(i);
-	}
-	return tabRes;
-};
+Util.fizzBuzz = function(n) {};
 
 /**

[Killed] IfStatement
TestUnitaire/tp-jest/src/math.js:79:5
  */
 Util.fizzBuzz = function(n) {
 	var tabRes=[];
-	if(typeof n !=typeof 1) throw 'Unable to compute fizzBuzz for n not number (int)';
+	if(false) throw 'Unable to compute fizzBuzz for n not number (int)';
 	if(n<1){
 		throw 'Unable to compute fizzBuzz for n < 1';	

[Killed] IfStatement
TestUnitaire/tp-jest/src/math.js:79:5
  */
 Util.fizzBuzz = function(n) {
 	var tabRes=[];
-	if(typeof n !=typeof 1) throw 'Unable to compute fizzBuzz for n not number (int)';
+	if(true) throw 'Unable to compute fizzBuzz for n not number (int)';
 	if(n<1){
 		throw 'Unable to compute fizzBuzz for n < 1';	

[Killed] IfStatement
TestUnitaire/tp-jest/src/math.js:80:5
 Util.fizzBuzz = function(n) {
 	var tabRes=[];
 	if(typeof n !=typeof 1) throw 'Unable to compute fizzBuzz for n not number (int)';
-	if(n<1){
+	if(false){
 		throw 'Unable to compute fizzBuzz for n < 1';	
 	}

[Killed] IfStatement
TestUnitaire/tp-jest/src/math.js:80:5
 Util.fizzBuzz = function(n) {
 	var tabRes=[];
 	if(typeof n !=typeof 1) throw 'Unable to compute fizzBuzz for n not number (int)';
-	if(n<1){
+	if(true){
 		throw 'Unable to compute fizzBuzz for n < 1';	
 	}

[Killed] ForStatement
TestUnitaire/tp-jest/src/math.js:83:16
 	if(n<1){
 		throw 'Unable to compute fizzBuzz for n < 1';	
 	}
-	for (var i=1; i <= n; i++){
+	for (var i=1; false; i++){
     		if (i % 15 == 0) tabRes.push('FizzBuzz');
     		else if (i % 3 == 0) tabRes.push("Fizz");

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/math.js:83:16
 	if(n<1){
 		throw 'Unable to compute fizzBuzz for n < 1';	
 	}
-	for (var i=1; i <= n; i++){
+	for (var i=1; i < n; i++){
     		if (i % 15 == 0) tabRes.push('FizzBuzz');
     		else if (i % 3 == 0) tabRes.push("Fizz");

[Killed] IfStatement
TestUnitaire/tp-jest/src/math.js:84:11
 		throw 'Unable to compute fizzBuzz for n < 1';	
 	}
 	for (var i=1; i <= n; i++){
-    		if (i % 15 == 0) tabRes.push('FizzBuzz');
+    		if (true) tabRes.push('FizzBuzz');
     		else if (i % 3 == 0) tabRes.push("Fizz");
     		else if (i % 5 == 0) tabRes.push("Buzz");

[Killed] IfStatement
TestUnitaire/tp-jest/src/math.js:84:11
 		throw 'Unable to compute fizzBuzz for n < 1';	
 	}
 	for (var i=1; i <= n; i++){
-    		if (i % 15 == 0) tabRes.push('FizzBuzz');
+    		if (false) tabRes.push('FizzBuzz');
     		else if (i % 3 == 0) tabRes.push("Fizz");
     		else if (i % 5 == 0) tabRes.push("Buzz");

[Killed] IfStatement
TestUnitaire/tp-jest/src/math.js:85:16
 	}
 	for (var i=1; i <= n; i++){
     		if (i % 15 == 0) tabRes.push('FizzBuzz');
-    		else if (i % 3 == 0) tabRes.push("Fizz");
+    		else if (true) tabRes.push("Fizz");
     		else if (i % 5 == 0) tabRes.push("Buzz");
     		else tabRes.push(i);

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/math.js:85:16
 	}
 	for (var i=1; i <= n; i++){
     		if (i % 15 == 0) tabRes.push('FizzBuzz');
-    		else if (i % 3 == 0) tabRes.push("Fizz");
+    		else if (i % 3 != 0) tabRes.push("Fizz");
     		else if (i % 5 == 0) tabRes.push("Buzz");
     		else tabRes.push(i);

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/math.js:86:16
 	for (var i=1; i <= n; i++){
     		if (i % 15 == 0) tabRes.push('FizzBuzz');
     		else if (i % 3 == 0) tabRes.push("Fizz");
-    		else if (i % 5 == 0) tabRes.push("Buzz");
+    		else if (i * 5 == 0) tabRes.push("Buzz");
     		else tabRes.push(i);
 	}

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/math.js:86:16
 	for (var i=1; i <= n; i++){
     		if (i % 15 == 0) tabRes.push('FizzBuzz');
     		else if (i % 3 == 0) tabRes.push("Fizz");
-    		else if (i % 5 == 0) tabRes.push("Buzz");
+    		else if (i % 5 != 0) tabRes.push("Buzz");
     		else tabRes.push(i);
 	}

[Killed] Block
TestUnitaire/tp-jest/src/math.js:101:33
  * @param phrase
  * @returns {string}
  */
-Util.cipher = function (phrase) {
-	if(typeof phrase !='string') throw 'Unable to compute cipher for phrase not string';	
-	var res ="";
-	for(let i=0; i< phrase.length;i++){
-		if(phrase[i] !=" ") res+=String.fromCharCode(phrase[i].charCodeAt(0) + 1);
-		else res+=" ";
-	}
-	return res;
-};
+Util.cipher = function (phrase) {};
 
 /**

[Killed] IfStatement
TestUnitaire/tp-jest/src/math.js:102:5
  * @returns {string}
  */
 Util.cipher = function (phrase) {
-	if(typeof phrase !='string') throw 'Unable to compute cipher for phrase not string';	
+	if(false) throw 'Unable to compute cipher for phrase not string';	
 	var res ="";
 	for(let i=0; i< phrase.length;i++){

[Killed] IfStatement
TestUnitaire/tp-jest/src/math.js:102:5
  * @returns {string}
  */
 Util.cipher = function (phrase) {
-	if(typeof phrase !='string') throw 'Unable to compute cipher for phrase not string';	
+	if(true) throw 'Unable to compute cipher for phrase not string';	
 	var res ="";
 	for(let i=0; i< phrase.length;i++){

[Killed] StringLiteral
TestUnitaire/tp-jest/src/math.js:103:11
  */
 Util.cipher = function (phrase) {
 	if(typeof phrase !='string') throw 'Unable to compute cipher for phrase not string';	
-	var res ="";
+	var res ="Stryker was here!";
 	for(let i=0; i< phrase.length;i++){
 		if(phrase[i] !=" ") res+=String.fromCharCode(phrase[i].charCodeAt(0) + 1);

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/math.js:104:15
 Util.cipher = function (phrase) {
 	if(typeof phrase !='string') throw 'Unable to compute cipher for phrase not string';	
 	var res ="";
-	for(let i=0; i< phrase.length;i++){
+	for(let i=0; i >= phrase.length;i++){
 		if(phrase[i] !=" ") res+=String.fromCharCode(phrase[i].charCodeAt(0) + 1);
 		else res+=" ";

[Killed] Block
TestUnitaire/tp-jest/src/math.js:104:36
 Util.cipher = function (phrase) {
 	if(typeof phrase !='string') throw 'Unable to compute cipher for phrase not string';	
 	var res ="";
-	for(let i=0; i< phrase.length;i++){
-		if(phrase[i] !=" ") res+=String.fromCharCode(phrase[i].charCodeAt(0) + 1);
-		else res+=" ";
-	}
+	for(let i=0; i< phrase.length;i++){}
 	return res;
 };

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/math.js:105:6
 	if(typeof phrase !='string') throw 'Unable to compute cipher for phrase not string';	
 	var res ="";
 	for(let i=0; i< phrase.length;i++){
-		if(phrase[i] !=" ") res+=String.fromCharCode(phrase[i].charCodeAt(0) + 1);
+		if(phrase[i] == " ") res+=String.fromCharCode(phrase[i].charCodeAt(0) + 1);
 		else res+=" ";
 	}

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/math.js:105:48
 	if(typeof phrase !='string') throw 'Unable to compute cipher for phrase not string';	
 	var res ="";
 	for(let i=0; i< phrase.length;i++){
-		if(phrase[i] !=" ") res+=String.fromCharCode(phrase[i].charCodeAt(0) + 1);
+		if(phrase[i] !=" ") res+=String.fromCharCode(phrase[i].charCodeAt(0) - 1);
 		else res+=" ";
 	}

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/math.js:125:15
  */
 Util.pairs = function(array) {
 	let res=0;
-	for(let i=0; i<array.length;i++){
+	for(let i=0; i >= array.length;i++){
 		let variable=array[i];	
 		for(let j=i+1; j<array.length;j++){

[Killed] Block
TestUnitaire/tp-jest/src/math.js:125:34
  */
 Util.pairs = function(array) {
 	let res=0;
-	for(let i=0; i<array.length;i++){
-		let variable=array[i];	
-		for(let j=i+1; j<array.length;j++){
-			if(variable==array[j]){
-				res++;			
-			}
-		}	
-	}
+	for(let i=0; i<array.length;i++){}
 	return res;
 };

[Killed] Block
TestUnitaire/tp-jest/src/math.js:127:37
 	let res=0;
 	for(let i=0; i<array.length;i++){
 		let variable=array[i];	
-		for(let j=i+1; j<array.length;j++){
-			if(variable==array[j]){
-				res++;			
-			}
-		}	
+		for(let j=i+1; j<array.length;j++){}	
 	}
 	return res;

[Killed] BinaryExpression
TestUnitaire/tp-jest/src/math.js:127:13
 	let res=0;
 	for(let i=0; i<array.length;i++){
 		let variable=array[i];	
-		for(let j=i+1; j<array.length;j++){
+		for(let j=i - 1; j<array.length;j++){
 			if(variable==array[j]){
 				res++;			
